{
  "imports": {
    "class": "imports",
    "CISCO-SMI": [
      "ciscoExperiment"
    ],
    "IF-MIB": [
      "ifIndex"
    ],
    "SNMPv2-CONF": [
      "NOTIFICATION-GROUP",
      "MODULE-COMPLIANCE"
    ],
    "SNMPv2-SMI": [
      "IpAddress",
      "OBJECT-IDENTITY",
      "Bits",
      "MODULE-IDENTITY",
      "Counter64",
      "Integer32",
      "OBJECT-TYPE",
      "TimeTicks",
      "Unsigned32",
      "Gauge32",
      "MibIdentifier",
      "iso",
      "NOTIFICATION-TYPE",
      "Counter32"
    ],
    "SNMPv2-TC": [
      "TEXTUAL-CONVENTION",
      "DisplayString"
    ],
    "SNMPv2-TC-v1": [
      "TruthValue"
    ]
  },
  "ciscoMetroPhyMIB": {
    "name": "ciscoMetroPhyMIB",
    "oid": "1.3.6.1.4.1.9.10.69",
    "class": "objectidentity"
  },
  "ciscoMetroPhyMIBObjects": {
    "name": "ciscoMetroPhyMIBObjects",
    "oid": "1.3.6.1.4.1.9.10.69.1",
    "class": "objectidentity"
  },
  "cmPhyIf": {
    "name": "cmPhyIf",
    "oid": "1.3.6.1.4.1.9.10.69.1.1",
    "class": "objectidentity"
  },
  "cmPhyStatistics": {
    "name": "cmPhyStatistics",
    "oid": "1.3.6.1.4.1.9.10.69.1.2",
    "class": "objectidentity"
  },
  "cmPhySonetSectionTrace": {
    "name": "cmPhySonetSectionTrace",
    "oid": "1.3.6.1.4.1.9.10.69.1.3",
    "class": "objectidentity"
  },
  "ciscoMetroPhyMIBConformance": {
    "name": "ciscoMetroPhyMIBConformance",
    "oid": "1.3.6.1.4.1.9.10.69.3",
    "class": "objectidentity"
  },
  "ciscoMetroPhyMIBCompliances": {
    "name": "ciscoMetroPhyMIBCompliances",
    "oid": "1.3.6.1.4.1.9.10.69.3.1",
    "class": "objectidentity"
  },
  "ciscoMetroPhyMIBGroups": {
    "name": "ciscoMetroPhyMIBGroups",
    "oid": "1.3.6.1.4.1.9.10.69.3.2",
    "class": "objectidentity"
  },
  "ProtocolType": {
    "name": "ProtocolType",
    "class": "type",
    "type": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "other": 1,
          "unknown": 2,
          "gigabitEthernet": 3,
          "tenGigabitEthernet": 4,
          "fibreChannel": 5,
          "ficon": 6,
          "escon": 7,
          "sonet": 8,
          "sdh": 9,
          "sysplexIscCompatibility": 10,
          "sysplexIscPeer": 11,
          "sysplexTimerEtr": 12,
          "sysplexTimerClo": 13,
          "fastEthernet": 14,
          "fddi": 15
        }
      }
    }
  },
  "cmPhyIfTable": {
    "name": "cmPhyIfTable",
    "oid": "1.3.6.1.4.1.9.10.69.1.1.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This table allows physical layer related interface configurations on an interface."
  },
  "cmPhyIfEntry": {
    "name": "cmPhyIfEntry",
    "oid": "1.3.6.1.4.1.9.10.69.1.1.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "A collection of objects for configuration on an interface."
  },
  "cmPhyIfMode": {
    "name": "cmPhyIfMode",
    "oid": "1.3.6.1.4.1.9.10.69.1.1.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "mode2R": 1,
          "mode3R": 2
        }
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This object allows the management client to configure the mode of operation for the client interface modules. When in 2R mode, there is no protocol type, clock rate or monitoring to be configured i.e. the next three objects would be read-only. When in 3R mode, monitoring can be enabled or disabled and the clock rate and protocol should be configured."
  },
  "cmPhyIfProtocol": {
    "name": "cmPhyIfProtocol",
    "oid": "1.3.6.1.4.1.9.10.69.1.1.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "ProtocolType",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This object is used to specify the protocol of the data carried over the client side interface. This object applies to linecards which support a variety of protocols and allow dynamic configuration of the specific protocol to be monitored on the interface. The ifType value for such interfaces remains fixed. The agent may use this object to identify the protocol to be monitored (see the cmPhyIfMonitor object), to set the clock rate for the interface (see the cmPhyIfClockRate object), or to enable or disable functionality related to the protocol, for example OFC (see the cmPhyIfOFC object). The value of this object cannot be modified when the cmPhyIfMonitor object is set to 'true' for that interface. Also, this object does not apply to the trunk side interfaces."
  },
  "cmPhyIfClockRate": {
    "name": "cmPhyIfClockRate",
    "oid": "1.3.6.1.4.1.9.10.69.1.1.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": 0,
            "max": 10312000
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This object allows the management client to set the clock rate across the client side interface. Due to hardware limitations, all values may not be supported. The default value of this object depends on the value of the cmPhyIfProtocol object. When the value of the cmPhyIfProtocol object is reset, the value of this object will be automatically set to the default for that protocol. In case of protocols that support multiple rates, the default value of this object will be the lowest rate possible for that protocol. For example, if the value of cmPhyIfProtocol is set to 'sonet', the default value of cmPhyIfClockRate is set to the OC-3 rate of 155520 kHz. If a non-default value is desired, then this object must be set after the cmPhyIfProtocol object has been reset. This object must be set to a supported clock rate when setting cmPhyIfProtocol to 'unknown'. In 2R mode of operation, this object is not applicable and will have a default value of 0. The value of this object cannot be modified when the cmPhyIfMonitor object is set to 'true' for that interface. Also, this object is not applicable to trunk side interfaces."
  },
  "cmPhyIfMonitor": {
    "name": "cmPhyIfMonitor",
    "oid": "1.3.6.1.4.1.9.10.69.1.1.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This object allows the management client to enable monitoring of the error counters on an interface, by writing a value of 'true' to this object. To bypass the monitoring hardware, a value of 'false' must be written to this object. Monitoring does not apply when the value of cmPhyIfProtocol is 'unknown'."
  },
  "cmPhyIfLoopback": {
    "name": "cmPhyIfLoopback",
    "oid": "1.3.6.1.4.1.9.10.69.1.1.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "enumeration": {
          "noLoop": 1,
          "diagnosticLoop": 2,
          "lineLoop": 3,
          "otherLoop": 4
        }
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This object allows the management client to configure loopback for the client side or trunk side interfaces. 'noLoop' - No Loopback present. 'diagnosticLoop' - This is an internal loopback, where the data stream is looped from the transmit to receive section. It is used for hardware debug, bring-up and diagnostics. 'lineLoop' - In this mode, the receive data stream is looped back to the transmit side. 'otherLoop' - This indicates loopbacks not defined here. The default value of this object will be 'noLoop'."
  },
  "cmPhyIfOFC": {
    "name": "cmPhyIfOFC",
    "oid": "1.3.6.1.4.1.9.10.69.1.1.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This object allows the management client to enable OFC(Open Fibre Control) safety protocol for the client side interfaces, by writing a 'true' value to this object. A 'false' value would disable OFC. The default value of this object varies depending on the value of cmPhyIfProtocol and cmPhyIfClockRate. When cmPhyIfProtocol or cmPhyIfClockRate is reset, then the value of this object is automatically reset to the default value for that protocol or rate. If non-default OFC behavior is desired, then this object should be set after cmPhyIfProtocol or cmPhyIfClockRate has been reset. This object is not applicable to trunk side interfaces."
  },
  "cmPhyIfLaserSafetyControl": {
    "name": "cmPhyIfLaserSafetyControl",
    "oid": "1.3.6.1.4.1.9.10.69.1.1.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "deprecated",
    "description": "This object allows the management client to enable laser safety control feature on the trunk side interfaces by writing a true value to this object. If laser safety control is enabled, the transmit laser on the trunk side is shut when the receive signal is not available on the fiber. A 'false' value disables this feature and is the default value assigned to this object. Laser safety control would not apply in case of splitter protection on the optical switch."
  },
  "cmPhyIfForwardLaserControl": {
    "name": "cmPhyIfForwardLaserControl",
    "oid": "1.3.6.1.4.1.9.10.69.1.1.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "TruthValue",
      "class": "type"
    },
    "maxaccess": "read-write",
    "status": "deprecated",
    "description": "This object allows the management client to enable forward laser control on the client or trunk side interfaces by writing a true value to this object. If forward laser control is enabled, the transmit laser is shut when the cross-connect receive port on the switch is in alarm condition. A 'false' value disables this feature and is the default value assigned to this object."
  },
  "cmPhyStatisticsTable": {
    "name": "cmPhyStatisticsTable",
    "oid": "1.3.6.1.4.1.9.10.69.1.2.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This table contains the cumulative error statistics being collected for the different medium types, except SONET, on the client side and an object for the optical power level on the trunk side. The error statistics for SONET are covered by the sonetSectionCurrentTable and the sonetSectionIntervalTable in the RFC1595-MIB."
  },
  "cmPhyStatisticsEntry": {
    "name": "cmPhyStatisticsEntry",
    "oid": "1.3.6.1.4.1.9.10.69.1.2.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the cmPhyStatisticsTable."
  },
  "cmPhyRxPower": {
    "name": "cmPhyRxPower",
    "oid": "1.3.6.1.4.1.9.10.69.1.2.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "INTEGER",
      "class": "type",
      "constraints": {
        "range": [
          {
            "min": -4000,
            "max": 0
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object gives the optical power level received on the trunk side interface. The actual value of the power level received on the interface is the value of this object divided by 100. This object is not applicable to client side interfaces. This object has been deprecated since a similar object has been defined in the CISCO-OPTICAL-MONITOR-MIB."
  },
  "cmPhyRxCVRD": {
    "name": "cmPhyRxCVRD",
    "oid": "1.3.6.1.4.1.9.10.69.1.2.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This object represents the lower word value of the counter associated with the number of code violations and running disparity errors encountered, in the receive direction. NOTE: The object cmPhyRxCVRDOverflow contains the higher 32 bits of this counter value. SNMP v2c or v3 managers can use the cmPhyHCRxCVRD object directly which is a 64 bit counter."
  },
  "cmPhyRxCVRDOverflow": {
    "name": "cmPhyRxCVRDOverflow",
    "oid": "1.3.6.1.4.1.9.10.69.1.2.1.1.3",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This object represents the high word value of the counter associated with the number of code violations and running disparity errors encountered, in the receive direction. NOTE: The object cmPhyRxCVRD contains the lower 32 bits of this counter value. If the error count is greater than 4,294,967,295 the higher word value will be stored in this object. SNMP v2c or v3 managers can use the cmPhyHCRxCVRD object directly which is a 64 bit counter."
  },
  "cmPhyHCRxCVRD": {
    "name": "cmPhyHCRxCVRD",
    "oid": "1.3.6.1.4.1.9.10.69.1.2.1.1.4",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This object represents the counter associated with the number of code violations and running disparity errors encountered, in the receive direction. This is a High Capacity (64 bit) version of the cmPhyRxCVRD counter."
  },
  "cmPhyRxHEC": {
    "name": "cmPhyRxHEC",
    "oid": "1.3.6.1.4.1.9.10.69.1.2.1.1.5",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object represents the lower word value of the counter associated with the number of CDL HEC errors encountered, in the receive direction. This object has a valid value only if the protocol type is gigabitEthernet/ tenGigabitEthernet. For all other protocols, this object is not applicable. NOTE: The object cmPhyRxHECOverflow contains the higher 32 bits of this counter value. SNMP v2c or v3 managers can use the cmPhyHCRxHEC object directly which is a 64 bit counter. This object has been deprecated since a similar object has been defined in the CISCO-CDL-MIB."
  },
  "cmPhyRxHECOverflow": {
    "name": "cmPhyRxHECOverflow",
    "oid": "1.3.6.1.4.1.9.10.69.1.2.1.1.6",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object represents the high word value of the counter associated with the number of CDL HEC errors encountered, in the receive direction. This object has a valid value only if the protocol type is gigabitEthernet/ tenGigabitEthernet. For all other protocols, this object is not applicable. NOTE: The object cmPhyRxHEC contains the lower 32 bits of this counter value. If the error count is greater than 4,294,967,295 the higher word value will be stored in this object. SNMP v2c or v3 managers can use the cmPhyHCRxHEC object directly which is a 64 bit counter. This object has been deprecated since a similar object has been defined in the CISCO-CDL-MIB."
  },
  "cmPhyHCRxHEC": {
    "name": "cmPhyHCRxHEC",
    "oid": "1.3.6.1.4.1.9.10.69.1.2.1.1.7",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "deprecated",
    "description": "This object represents the counter associated with the number of CDL HEC errors encountered, in the receive direction. This object has a valid value only if the medium type is gigabitEthernet/ tenGigabitEthernet. For all other media, this object is not applicable. This is a High Capacity (64 bit) version of the cmPhyRxHEC counter. This object has been deprecated since a similar object has been defined in the CISCO-CDL-MIB."
  },
  "cmPhyRxCRC": {
    "name": "cmPhyRxCRC",
    "oid": "1.3.6.1.4.1.9.10.69.1.2.1.1.8",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This object represents the lower word value of the counter associated with CRC errors. This object has a valid value only for interfaces that provide CRC error monitoring. NOTE: The object cmPhyRxCRCOverflow contains the higher 32 bits of this counter value. SNMP v2c or v3 managers can use the cmPhyHCRxCRC object directly which is a 64 bit counter."
  },
  "cmPhyRxCRCOverflow": {
    "name": "cmPhyRxCRCOverflow",
    "oid": "1.3.6.1.4.1.9.10.69.1.2.1.1.9",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This object represents the higher word value of the counter associated with CRC errors. This object has a valid value only for interfaces that provide CRC error monitoring. NOTE: The object cmPhyRxCRC contains the lower 32 bits of this counter value. If the error count is greater than 4,294,967,295 the higher word value will be stored in this object. SNMP v2c or v3 managers can use the cmPhyHCRxCRC object directly which is a 64 bit counter."
  },
  "cmPhyHCRxCRC": {
    "name": "cmPhyHCRxCRC",
    "oid": "1.3.6.1.4.1.9.10.69.1.2.1.1.10",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This object represents the counter associated with CRC errors. This object has a valid value only for interfaces that provide CRC error monitoring. This is a High Capacity (64 bit) version of the cmPhyRxCRC counter."
  },
  "cmPhyTxEncapFarEndPktErrors": {
    "name": "cmPhyTxEncapFarEndPktErrors",
    "oid": "1.3.6.1.4.1.9.10.69.1.2.1.1.11",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This object represents the lower word value of the counter associated with ingress error indications from the far end of an Ethernet network, where an ESCON stream is encapsulated in Ethernet packets. This counter is incremented whenever an ESCON packet or control character has 8b/10b code violations or running disparity errors in the ingress direction at the far end of the Ethernet network. This object has a valid value only for ESCON interfaces where Ethernet encapsulation is performed. NOTE: The object cmPhyTxEncapFarEndPktErrOverflow contains the higher 32 bits of this counter value. SNMP v2c or v3 managers can use the cmPhyHCTxEsconPktInd object directly which is a 64 bit counter."
  },
  "cmPhyTxEncapFarEndPktErrOverflow": {
    "name": "cmPhyTxEncapFarEndPktErrOverflow",
    "oid": "1.3.6.1.4.1.9.10.69.1.2.1.1.12",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This object represents the higher word value of the counter associated with ingress error indications from the far end of an Ethernet network, where an ESCON stream is encapsulated in Ethernet packets. This counter is incremented whenever an ESCON packet or control character has 8b/10b code violations or running disparity errors in the ingress direction at the far end of the Ethernet network. This object has a valid value only for ESCON interfaces where Ethernet encapsulation is performed. NOTE: The object cmPhyTxEncapFarEndPktErrors contains the lower 32 bits of this counter value. SNMP v2c or v3 managers can use the cmPhyHCTxEsconPktInd object directly which is a 64 bit counter."
  },
  "cmPhyHCTxEncapFarEndPktErrors": {
    "name": "cmPhyHCTxEncapFarEndPktErrors",
    "oid": "1.3.6.1.4.1.9.10.69.1.2.1.1.13",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "Counter",
      "class": "type"
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This object represents the counter associated with ESCON ingress error indications from the far end of an Ethernet network, where an ESCON stream is encapsulated in Ethernet packets. This counter is incremented whenever an ESCON packet or control character has 8b/10b code violations or running disparity errors in the ingress direction at the far end of the Ethernet network. This object has a valid value only for ESCON interfaces where Ethernet encapsulation is performed. This is a High Capacity (64 bit) version of the cmPhyTxEncapFarEndPktErrors counter."
  },
  "cmPhySonetSectionTraceTable": {
    "name": "cmPhySonetSectionTraceTable",
    "oid": "1.3.6.1.4.1.9.10.69.1.3.1",
    "nodetype": "table",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "status": "mandatory",
    "description": "This table provides objects for monitoring the J0 bytes of a SONET or SDH section."
  },
  "cmPhySonetSectionTraceEntry": {
    "name": "cmPhySonetSectionTraceEntry",
    "oid": "1.3.6.1.4.1.9.10.69.1.3.1.1",
    "nodetype": "row",
    "class": "objecttype",
    "maxaccess": "not-accessible",
    "indices": [
      {
        "module": "IF-MIB",
        "object": "ifIndex",
        "implied": 0
      }
    ],
    "status": "mandatory",
    "description": "An entry in the cmPhySonetSectionTraceTable is created when the value of the cmPhyIfProtocol object is set to 'sonet' and the value of cmPhyIfMonitor is set to 'true'."
  },
  "cmPhySonetSectionTraceReceived": {
    "name": "cmPhySonetSectionTraceReceived",
    "oid": "1.3.6.1.4.1.9.10.69.1.3.1.1.1",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 16,
            "max": 16
          },
          {
            "min": 64,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-only",
    "status": "mandatory",
    "description": "This object displays the SONET or SDH section trace bytes received at the interface."
  },
  "cmPhySonetSectionTraceExpected": {
    "name": "cmPhySonetSectionTraceExpected",
    "oid": "1.3.6.1.4.1.9.10.69.1.3.1.1.2",
    "nodetype": "column",
    "class": "objecttype",
    "syntax": {
      "type": "OCTET STRING",
      "class": "type",
      "constraints": {
        "size": [
          {
            "min": 0,
            "max": 0
          },
          {
            "min": 16,
            "max": 16
          },
          {
            "min": 64,
            "max": 64
          }
        ]
      }
    },
    "maxaccess": "read-write",
    "status": "mandatory",
    "description": "This object defines the SONET or SDH section trace bytes to be expected at the interface. The default value of this object will be a zero length string."
  },
  "cmPhyIfGroup": {
    "name": "cmPhyIfGroup",
    "oid": "1.3.6.1.4.1.9.10.69.3.2.1",
    "class": "objectidentity"
  },
  "cmPhyStatisticsGroup": {
    "name": "cmPhyStatisticsGroup",
    "oid": "1.3.6.1.4.1.9.10.69.3.2.2",
    "class": "objectidentity"
  },
  "cmPhySonetSectionTraceGroup": {
    "name": "cmPhySonetSectionTraceGroup",
    "oid": "1.3.6.1.4.1.9.10.69.3.2.3",
    "class": "objectidentity"
  },
  "cmPhyIf2Group": {
    "name": "cmPhyIf2Group",
    "oid": "1.3.6.1.4.1.9.10.69.3.2.4",
    "class": "objectidentity"
  },
  "cmPhyCVRDErrorsGroup": {
    "name": "cmPhyCVRDErrorsGroup",
    "oid": "1.3.6.1.4.1.9.10.69.3.2.5",
    "class": "objectidentity"
  },
  "cmPhyCRCErrorsGroup": {
    "name": "cmPhyCRCErrorsGroup",
    "oid": "1.3.6.1.4.1.9.10.69.3.2.6",
    "class": "objectidentity"
  },
  "cmPhyEncapFarEndPktErrorsGroup": {
    "name": "cmPhyEncapFarEndPktErrorsGroup",
    "oid": "1.3.6.1.4.1.9.10.69.3.2.7",
    "class": "objectidentity"
  },
  "cmPhyMIBCompliance": {
    "name": "cmPhyMIBCompliance",
    "oid": "1.3.6.1.4.1.9.10.69.3.1.1",
    "class": "objectidentity"
  },
  "cmPhyMIBCompliance2": {
    "name": "cmPhyMIBCompliance2",
    "oid": "1.3.6.1.4.1.9.10.69.3.1.2",
    "class": "objectidentity"
  },
  "meta": {
    "comments": [
      "ASN.1 source file://MIBS/asn1/CISCO-METRO-PHY-MIB-V1SMI.mib",
      "Produced by pysmi-0.3.4 at Tue Apr 20 15:30:03 2021",
      "On host samy-ThinkPad-T495s platform Linux version 5.8.0-50-generic by user root",
      "Using Python version 3.8.5 (default, Jan 27 2021, 15:41:15) "
    ],
    "module": "CISCO-METRO-PHY-MIB"
  }
}