{
  "imports": {
    "class": "imports",
    "AFC-OIDS": [
      "umc1000"
    ],
    "SNMPv2-CONF": [
      "MODULE-COMPLIANCE",
      "NOTIFICATION-GROUP"
    ],
    "SNMPv2-SMI": [
      "IpAddress",
      "Bits",
      "TimeTicks",
      "OBJECT-TYPE",
      "Unsigned32",
      "iso",
      "Integer32",
      "MODULE-IDENTITY",
      "Gauge32",
      "OBJECT-IDENTITY",
      "MibIdentifier",
      "Counter64",
      "TRAP-TYPE",
      "Counter32",
      "NOTIFICATION-TYPE"
    ],
    "SNMPv2-TC": [
      "TEXTUAL-CONVENTION",
      "DisplayString"
    ],
    "UMC1000-MIB": [
      "umc1TR8ChgData",
      "umc1AlmSeqNumber",
      "umc1SystemTCAHistoryTableSeqNum",
      "umc1TL1IfProvTableChangeSeqNum",
      "umc1CurAlmDetails",
      "umc1TerminalSpanTableChangeSeqNum",
      "umc1InventoryPluginTableChangeSeqNum",
      "umc1FacAlmStringTableChangeSeqNum",
      "umc1SystemTCAHistoryTableChgData",
      "umc1TerminalInfoSerialDeviceType",
      "umc1F5LoopbackTransactionResponse",
      "umc1CurAlmTL1Message",
      "umc1XCTableChangeSeqNum",
      "umc1ShelfSpanTableChangeSeqNum",
      "umc1SoftwareDiagMessageType",
      "umc1TR8TableChangeSeqNum",
      "umc1AtmProtTableChangeSeqNum",
      "umc1FacAlmStringChgData",
      "umc1TerminalInfoChangeSeqNum",
      "umc1TopologyChangeSeqNum",
      "umc1XCChgData",
      "umc1TerminalInfoTerminalId",
      "umc1SystemSysProvChgSeqNbr",
      "umc1InventoryShelfTableChangeSeqNum",
      "umc1V5ChgData",
      "umc1SecurityDataTableChangeSeqNum",
      "umc1TerminalStatusChangeSeqNum",
      "umc1SystemPitProvChgData",
      "umc1CurAlmTerminalId",
      "umc1SystemGenericDbProvChgData",
      "umc1CurAlmOccurrenceIndex",
      "umc1LoopDiagnosticsTrapData",
      "umc1SystemGenericDbProvTableSeqNum",
      "umc1InventoryPluginTableChangeHistoryData",
      "umc1AlmSeqTableChangeSeqNum",
      "umc1AtmProtGrpChgData",
      "umc1GR303ChgData",
      "umc1TerminalInfoBaudRate",
      "umc1PortProfChgData",
      "umc1SystemSysProvChgData",
      "umc1SoftwareDiagMessageTimestamp",
      "umc1ShelfSpanTableChangeHistoryData",
      "umc1GR303TableChangeSeqNum",
      "umc1TL1IfProvChgData",
      "umc1SystemPitProvChgSeqNbr",
      "umc1SoftwareDiagMessageString",
      "umc1SystemRelearnTrapSeqNum",
      "umc1V5TableChangeSeqNum",
      "umc1SystemAllSeqNbr",
      "umc1SecurityDataChgData",
      "umc1TerminalSpanTableChangeHistoryData",
      "umc1InventoryShelfTableChangeHistoryData",
      "umc1PortProfTableChangeSeqNum",
      "umc1TerminalInfoName",
      "umc1TerminalInfoNewTerminalId"
    ]
  },
  "umc1TrapAlarmEvent": {
    "name": "umc1TrapAlarmEvent",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1AlmSeqTableChangeSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1AlmSeqNumber"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1CurAlmTerminalId"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1CurAlmOccurrenceIndex"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1CurAlmTL1Message"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1CurAlmDetails"
      }
    ],
    "description": "This trap indicates that an Alarm or Status Event has occured in the UMC. The Alarm Details (or TL1 message) must be examined to determine the severity of the alarm."
  },
  "umc1TrapTerminalStatusChange": {
    "name": "umc1TrapTerminalStatusChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000001",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1TerminalStatusChangeSeqNum"
      }
    ],
    "description": "This trap indicates that the status for one or more terminals may have changed and therefore the terminal status table needs to be read again."
  },
  "umc1TrapTerminalInfoChange": {
    "name": "umc1TrapTerminalInfoChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000002",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1TerminalInfoChangeSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1TerminalInfoTerminalId"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1TerminalInfoName"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1TerminalInfoSerialDeviceType"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1TerminalInfoBaudRate"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1TerminalInfoNewTerminalId"
      }
    ],
    "description": "This trap indicates that the provisioning information for a terminal has changed. If the sequence number stored in the first varbind is the next sequential number as known by the EMS, *AND* the sequence number matches that in the umc1TerminalInfoChangeSeqNum MIB variable (as fetched from the UMC), then the corresponding data can be used to update the EMSs view of the data. Otherwise, it must be assumed that the EMS has either lost a trap or the SNMP agent has rebooted, and therefore the EMS must re-read the whole table."
  },
  "umc1TrapTopologyChange": {
    "name": "umc1TrapTopologyChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000003",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1TopologyChangeSeqNum"
      }
    ],
    "description": "This trap indicates that the information in the topology link table and/or the orphan table may have changed and therefore these tables need to be read again."
  },
  "umc1TrapInventoryShelfTableChange": {
    "name": "umc1TrapInventoryShelfTableChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000004",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1InventoryShelfTableChangeSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1InventoryShelfTableChangeHistoryData"
      }
    ],
    "description": "This trap indicates that umc1InventoryShelfTable has changed. The location and type of all shelves that have been added to the system since the last trap was emitted are stored in the object umc1InventoryShelfTableChangeHistoryData. If the sequence number stored in the first varbind is the next sequential number as known by the EMS, *AND* the sequence number matches that in the umc1InventoryShelfTableChangeSeqNum MIB variable (as fetched from the UMC), then the corresponding data can be used to update the EMSs view of the data. Otherwise, it must be assumed that the EMS has either lost a trap or the SNMP agent has rebooted. In such a case the EMS must attempt to read a row indexed by the value of umc1InventoryShelfTableChangeSeqNum (in the varbind) in the table umc1InventoryShelfTableChangeHistoryTable from the UMC. If successful, it must update the data in its umc1InventoryShelfTable with the data it read from such a row and all other rows in the table indexed by values higher than the value of umc1InventoryShelfTableChangeSeqNum, if present, till it reaches the end of the table. Otherwise, the EMS must re-read the whole umc1InventoryShelfTable from the UMC."
  },
  "umc1TrapInventoryPluginTableChange": {
    "name": "umc1TrapInventoryPluginTableChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000005",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1InventoryPluginTableChangeSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1InventoryPluginTableChangeHistoryData"
      }
    ],
    "description": "This trap indicates thatumc1InventoryPluginTable has changed. The location and plug-in type of all cards that have been added to the system since the last trap was emitted are stored in the object umc1InventoryPluginTableChangeHistoryData. If the sequence number stored in the first varbind is the next sequential number as known by the EMS, *AND* the sequence number matches that in the umc1InventoryPluginTableChangeSeqNum MIB variable (as fetched from the UMC), then the corresponding data can be used to update the EMSs view of the data. Otherwise, it must be assumed that the EMS has either lost a trap or the SNMP agent has rebooted. In such a case the EMS must attempt to read a row indexed by the value of umc1InventoryPluginTableChangeSeqNum (in the varbind) in the table umc1InventoryPluginTableChangeHistoryTable from the UMC. If successful, it must update the data in its umc1InventoryPluginTable with the data it read from such a row and all other rows in the table indexed by values higher than the value of umc1InventoryPluginTableChangeSeqNum, if present, till it reaches the end of the table. Otherwise, the EMS must re-read the whole umc1InventoryPluginTable from the UMC."
  },
  "umc1TrapPitProvChgTableChange": {
    "name": "umc1TrapPitProvChgTableChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000006",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1SystemPitProvChgSeqNbr"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1SystemPitProvChgData"
      }
    ],
    "description": "The trap contains the new row created in the Plug-In Provisioning Change Table. The management host compares this umc1SystemPitProvChgSeqNbr value with the last one received to determine if any traps have been lost. If this value is one greater than the last one received, no traps were lost, and the management host uses the five octets following the version octet in umc1SystemPitProvChgData, the second varbind, to retrieve the location and Plug-in type of the Plug-in whose provisioning data has changed. The value of the seventh octet in umc1SystemPitProvChgData for the given plug-in location and plug-in type is defined by 'DbActionType' in UMC1000.MIB. If the seventh octet indicates the record was deleted it must delete the plug-in provisioning database record for the given plug-in location and plug-in type. Otherwise, if the seventh octet indicates the record added or updated it must retrieve the provisioning database record from the octets following the seventh octet and update the provisioning data of the given plug-in location and plug-in type. If the value of umc1SystemPitProvChgSeqNbr is more than one (1) greater than the last one received, the management host determines it has lost one or more of these Traps. The management host attempts to retrieve the entry in the Plug-In Provisioning Change Table indexed by the last value umc1SystemPitProvChgSeqNbr received. If this entry cannot be retrieved, the management host determines that more traps have been lost than the number of entries the Plug-In Provisioning Change table can store. The management host then reads the entire Plug-In Provisioning Table to re-sync with that of the agent."
  },
  "umc1TrapSystemRelearnTrap": {
    "name": "umc1TrapSystemRelearnTrap",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000008",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1SystemRelearnTrapSeqNum"
      }
    ],
    "description": "This trap indicates that the ACO operation has been performed on the system. If the sequence number stored in the varbind is the next sequential number as known by the EMS, and the sequence number matches that in the umc1SystemRelearnTrapSeqNum MIB variable (as fetched from the UMC), then the EMS has received all such traps. Otherwise, it must be assumed that the EMS has either lost such a trap or the SNMP agent has rebooted. Data in umc1ACOSnapTopologyLinkTable contains the snapshot of topology information at the time the trap was emitted by the agent."
  },
  "umc1TrapSysProvChange": {
    "name": "umc1TrapSysProvChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000009",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1SystemSysProvChgSeqNbr"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1SystemSysProvChgData"
      }
    ],
    "description": "This trap references a row in the System Global Provisioning Change Table. The management host compares this umc1SystemSysProvChgSeqNbr value with the last one received to determine if any traps have been lost. If the this value is one greater than the last one received, no traps were lost, and the management host uses the data in umc1SystemSysProvChgData varbind to effect the change in its local copy. If this value is more than one (1) greater than the last one received, the management host determines it has lost one or more of these Traps. The management host attempts to retrieve the entry in the System Global Provisioning Change Table following that indexed by the last value umc1SystemSysProvChgSeqNbr received. If this entry cannot be retrieved, the management host determines that more traps have been lost than the number of entries the System Global Provisioning Change table can cache. The management host then reads the all objects in the Global System Provisioning Object Group to re-sync with the Agents. If the next entry is retrieved successfully, the management host continues reading next entries until it has retrieved the entry indexed by the varbinds in this trap. "
  },
  "umc1TrapTerminalSpanTableChange": {
    "name": "umc1TrapTerminalSpanTableChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000010",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1TerminalSpanTableChangeSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1TerminalSpanTableChangeHistoryData"
      }
    ],
    "description": "The trap contains the new row created in the umc1TerminalSpanTable. The management host compares this umc1TerminalSpanChangeSeqNum value with the last one received to determine if any traps have been lost. If this value is one greater than the last one received, no traps were lost. "
  },
  "umc1TrapShelfSpanTableChange": {
    "name": "umc1TrapShelfSpanTableChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000011",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1ShelfSpanTableChangeSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1ShelfSpanTableChangeHistoryData"
      }
    ],
    "description": "The trap contains the new row created in the umc1ShelfSpanTable The management host compares this umc1ShelfSpanChangeSeqNum value with the last one received to determine if any traps have been lost. If this value is one greater than the last one received, no traps were lost. "
  },
  "umc1TrapGR303TableChange": {
    "name": "umc1TrapGR303TableChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000012",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1GR303TableChangeSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1GR303ChgData"
      }
    ],
    "description": "The trap contains the new row created in the umc1GR303ChgTable. The management host compares this umc1GR303TableChangeSeqNum value with the last one received to determine if any traps have been lost. If this value is one greater than the last one received, no traps were lost. "
  },
  "umc1TrapTR8TableChange": {
    "name": "umc1TrapTR8TableChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000013",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1TR8TableChangeSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1TR8ChgData"
      }
    ],
    "description": "The trap contains the new row created in the umc1TR8ChgTable. The management host compares this umc1TR8TableChangeSeqNum value with the last one received to determine if any traps have been lost. If this value is one greater than the last one received, no traps were lost. "
  },
  "umc1TrapXCTableChange": {
    "name": "umc1TrapXCTableChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000014",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1XCTableChangeSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1XCChgData"
      }
    ],
    "description": "The trap contains the new row created in the umc1XCChgTable. The management host compares this umc1XCTableChangeSeqNum value with the last one received to determine if any traps have been lost. If this value is one greater than the last one received, no traps were lost. "
  },
  "umc1TrapAtmProtGrpTableChange": {
    "name": "umc1TrapAtmProtGrpTableChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000015",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1AtmProtTableChangeSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1AtmProtGrpChgData"
      }
    ],
    "description": "The trap contains the new row created in the umc1AtmProtGrpChgTable. The management host compares this umc1AtmProtTableChangeSeqNum value with the last one received to determine if any traps have been lost. If this value is one greater than the last one received, no traps were lost. "
  },
  "umc1TrapPortProfTableChange": {
    "name": "umc1TrapPortProfTableChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000016",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1PortProfTableChangeSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1PortProfChgData"
      }
    ],
    "description": "The trap contains the new row created in the umc1PortProfChgTable. The management host compares this umc1PortProfTableChangeSeqNum value with the last one received to determine if any traps have been lost. If this value is one greater than the last one received, no traps were lost. "
  },
  "umc1TrapV5TableChange": {
    "name": "umc1TrapV5TableChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000017",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1V5TableChangeSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1V5ChgData"
      }
    ],
    "description": "The trap contains the new row created in the umc1V5ChgTable. The management host compares this umc1V5TableChangeSeqNum value with the last one received to determine if any traps have been lost. If this value is one greater than the last one received, no traps were lost. "
  },
  "umc1TrapSecurityDataTableChange": {
    "name": "umc1TrapSecurityDataTableChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000018",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1SecurityDataTableChangeSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1SecurityDataChgData"
      }
    ],
    "description": "The trap contains the new row created in the umc1SecurityDataChgTable. The management host compares this umc1SecurityDataTableChangeSeqNum value with the last one received to determine if any traps have been lost. If this value is one greater than the last one received, no traps were lost. "
  },
  "umc1TrapFacAlmStringTableChange": {
    "name": "umc1TrapFacAlmStringTableChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000019",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1FacAlmStringTableChangeSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1FacAlmStringChgData"
      }
    ],
    "description": "The trap contains the new row created in the umc1FacAlmStringChgTable. The management host compares this umc1FacAlmStringTableChangeSeqNum value with the last one received to determine if any traps have been lost. If this value is one greater than the last one received, no traps were lost. "
  },
  "umc1TrapTL1IfProvTableChange": {
    "name": "umc1TrapTL1IfProvTableChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000020",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1TL1IfProvTableChangeSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1TL1IfProvChgData"
      }
    ],
    "description": "The trap contains the new row created in the umc1TL1IfProvChgTable. The management host compares this umc1TL1IfProvTableChangeSeqNum value with the last one received to determine if any traps have been lost. If this value is one greater than the last one received, no traps were lost. "
  },
  "umc1TrapGenericDbProvChange": {
    "name": "umc1TrapGenericDbProvChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000021",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1SystemGenericDbProvTableSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1SystemGenericDbProvChgData"
      }
    ],
    "description": "The trap contains the new row created in the umc1SystemGenericDbProvChgTable. The management host compares this umc1SystemGenericDbProvTableSeqNum value with the last one received to determine if any traps have been lost. If this value is one greater than the last one received, no traps were lost. "
  },
  "umc1TrapSoftwareDiagnostics": {
    "name": "umc1TrapSoftwareDiagnostics",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1100000001",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1SoftwareDiagMessageTimestamp"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1SoftwareDiagMessageType"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1SoftwareDiagMessageString"
      }
    ],
    "description": "This trap passes software diagnostic messages from the IPMI card to an external SNMP monitoring device."
  },
  "umc1TrapAllSeqNbrDump": {
    "name": "umc1TrapAllSeqNbrDump",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1100000002",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1SystemAllSeqNbr"
      }
    ],
    "description": " This trap passes all sequence numbers from the agent to Management station. This trap is instantiated when a Management station sends SNMP GET Request to read all sequence numbers."
  },
  "umc1TrapTCAHistoryTableChange": {
    "name": "umc1TrapTCAHistoryTableChange",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000022",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1SystemTCAHistoryTableSeqNum"
      },
      {
        "module": "UMC1000-MIB",
        "object": "umc1SystemTCAHistoryTableChgData"
      }
    ],
    "description": "The trap contains the new row created in the umc1SystemTCAHistoryTable. The management host compares this umc1SystemTCAHistoryTableSeqNum value with the last one received to determine if any traps have been lost. If this value is one greater than the last one received, no traps were lost. "
  },
  "umc1F5LoopbackResult": {
    "name": "umc1F5LoopbackResult",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000023",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1F5LoopbackTransactionResponse"
      }
    ],
    "description": "The trap contains the new result of an F5 Loopback request. Because of the delay in this request, the results come to the EMS as a trap so we don't have to wait on a SET."
  },
  "umc1LoopbackDiagnosticsTrap": {
    "name": "umc1LoopbackDiagnosticsTrap",
    "oid": "1.3.6.1.4.1.2067.1.1.20.1000000024",
    "class": "notificationtype",
    "objects": [
      {
        "module": "UMC1000-MIB",
        "object": "umc1LoopDiagnosticsTrapData"
      }
    ],
    "description": "The trap contains the new result of the LoopCharacteristics part of a LoopDiagnostic ADSL2+ response. Because of the delay in this request, the results come to the EMS as a trap so we don't have to wait on a SET. Remaining results (the noise parameters) can be retrieved using the umc1LoopDiagnosticsDataRequestTable"
  },
  "meta": {
    "comments": [
      "ASN.1 source file://MIBS/asn1/UMC1000TRAPS.mib",
      "Produced by pysmi-0.3.4 at Tue Apr 20 17:42:43 2021",
      "On host samy-ThinkPad-T495s platform Linux version 5.8.0-50-generic by user root",
      "Using Python version 3.8.5 (default, Jan 27 2021, 15:41:15) "
    ],
    "module": "UMC1000TRAPS"
  }
}